# ========== 1.Numpy 入门：数组、切片、四则运算、广播 ==========
# pip install numpy pandas matplotlib seaborn -i https://pypi.tuna.tsinghua.edu.cn/simple

# ndarray：Numpy 核心数组，对标 Python 原生 list，但连续内存、运算速度近 C 语言，AI 张量底层原型；
# 切片 arr[行:行,列:列]，支持多维截取；
# 数组直接加减乘除 = 逐元素运算，不用循环；
# 广播机制：不同形状数组自动补齐维度运算（深度学习最常用）。
import numpy as np

# 1. 创建数组
arr1 = np.array([1,2,3,4])        # 一维数组
arr2 = np.array([[1,2],[3,4]])    # 二维矩阵(2行2列)
print("数组形状shape:", arr2.shape)
# 输出：数组形状shape: (2, 2) → (行数,列数)

# 2. 切片取值
print(arr2[0,1])       # 第0行第1列：2
# 输出：2
print(arr2[:,0])       # :代表所有行、第0列 [1,3]
# 输出：[1 3]

# 3. 基础运算(逐元素运算，数组每个数字分别+2、*3)
print(arr1 + 2)
# [3 4 5 6]
print(arr1 * 3)
# [ 3  6  9 12]

# 4. 广播：a(1,2)  b(2,1) 自动扩维成同形状相加
a = np.array([10,20])
b = np.array([[1],[2]])
print(a + b)
"""
[[11 21]
 [12 22]]
"""

# 任务：矩阵运算
m1 = np.array([[1,2],
               [3,4]])
m2 = np.array([[2,0],
               [1,3]])
print("矩阵逐元素相乘:\n",m1*m2)
# 位置一对一相乘（对应下标相乘）
# [1*2 , 2*0]
# [3*1 , 4*3]
# =
# [[2,0],[3,12]]
"""
[[2 0]
 [3 12]]
"""

print("数学矩阵乘法:\n",m1 @ m2)
# 规则：第一个的行・第二个的列，累加
# 结果第一行第一列：
# 1×2 + 2×1 = 4
# 第一行第二列：
# 1×0 + 2×3 = 6
# 第二行第一列：
# 3×2 + 4×1 = 10
# 第二行第二列：
# 3×0 + 4×3 = 12
"""
[[ 4  6]
 [10 12]]
"""